import { Component, AfterViewInit } from '@angular/core';
@Component({
	templateUrl: './starter.component.html'
})
export class StarterComponent implements AfterViewInit {
	subtitle:string[];	
	constructor() {
		this.subtitle = ["Enhanced Interior Gateway Routing Protocol (EIGRP) е усъвършенстван протокол за маршрутизиране на разстояния, разработен от Cisco Systems. Както подсказва името, EIGRP е подобрение на друг маршрутизационен протокол Cisco IGRP (Internal Gateway Routing Protocol). IGRP е по-стар класически протокол за маршрутизиране на разстояния, сега остарял от IOS 12.3.",
		"EIGRP е протокол за маршрутизиране на векторни разстояния, който включва функции, намиращи се в протоколите за маршрутизиране на състоянието на връзката. EIGRP е подходящ за много различни топологии и медии. В добре проектирана мрежа, EIGRP може да мащабира, за да включва множество топологии и може да осигури изключително бързо време за сближаване с минимален мрежов трафик.",
		"Тази сайт представя EIGRP и предоставя основни команди за конфигуриране, за да го активирате на маршрутизатор на Cisco IOS. Той също така изследва работата на маршрутизиращия протокол и предоставя повече подробности за това как EIGRP определя най-добрия път."]
	}
	
	ngAfterViewInit(){}
}